### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [1]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [3]:
import pandas

In [4]:
dict1 = {
    'Name': ["SAHIBZADA JAWAD HADI", "Ibraheem khan", "Muhammad Abid", "Shumail Khan","Qasim Ali"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["1st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"],
    'GPA': [3.4, 3.5, 3.5, 2.6, 1.0]
}

In [5]:
df = pandas.DataFrame(dict1)

In [6]:
df = pandas.DataFrame(dict1)

In [7]:
df

                   Name  Marks     Class  GPA
0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1         Ibraheem khan     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(dict1)

In [10]:
df

                   Name  Marks     Class  GPA
0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1         Ibraheem khan     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [11]:
pd.__version__

'1.3.5'

## Import to CSV

In [12]:
df.to_csv('pythonMonday.csv')

## Remove Index

In [13]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [14]:
df.head()

                   Name  Marks     Class  GPA
0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1         Ibraheem khan     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

In [15]:
df.head()

                   Name  Marks     Class  GPA
0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1         Ibraheem khan     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

In [16]:
df.tail(3)

            Name  Marks     Class  GPA
2  Muhammad Abid     77  1st Year  3.5
3   Shumail Khan     65  3rd Year  2.6
4      Qasim Ali     15  2nd Year  1.0

In [17]:
df.tail()

                   Name  Marks     Class  GPA
0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1         Ibraheem khan     72  2nd Year  3.5
2         Muhammad Abid     77  1st Year  3.5
3          Shumail Khan     65  3rd Year  2.6
4             Qasim Ali     15  2nd Year  1.0

In [18]:
df.describe()

           Marks       GPA
count   5.000000  5.000000
mean   61.800000  2.800000
std    26.771253  1.074709
min    15.000000  1.000000
25%    65.000000  2.600000
50%    72.000000  3.400000
75%    77.000000  3.500000
max    80.000000  3.500000

In [20]:
classData= pd.read_csv(r'C:\Users\Hp\Desktop\folder 3.2\pythonMonday.csv')

In [21]:
classData

   Unnamed: 0                  Name  Marks     Class  GPA
0           0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1           1         Ibraheem khan     72  2nd Year  3.5
2           2         Muhammad Abid     77  1st Year  3.5
3           3          Shumail Khan     65  3rd Year  2.6
4           4             Qasim Ali     15  2nd Year  1.0

In [22]:
classData.drop(0, axis=0)

   Unnamed: 0           Name  Marks     Class  GPA
1           1  Ibraheem khan     72  2nd Year  3.5
2           2  Muhammad Abid     77  1st Year  3.5
3           3   Shumail Khan     65  3rd Year  2.6
4           4      Qasim Ali     15  2nd Year  1.0

In [23]:
classData

   Unnamed: 0                  Name  Marks     Class  GPA
0           0  SAHIBZADA JAWAD HADI     80  1st Year  3.4
1           1         Ibraheem khan     72  2nd Year  3.5
2           2         Muhammad Abid     77  1st Year  3.5
3           3          Shumail Khan     65  3rd Year  2.6
4           4             Qasim Ali     15  2nd Year  1.0

In [24]:
classData['Marks']

0    80
1    72
2    77
3    65
4    15
Name: Marks, dtype: int64

In [25]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [26]:
classData['Class']

0    1st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [27]:
classData['Name']

0    SAHIBZADA JAWAD HADI
1           Ibraheem khan
2           Muhammad Abid
3            Shumail Khan
4               Qasim Ali
Name: Name, dtype: object

In [28]:
classData['Name']

0    SAHIBZADA JAWAD HADI
1           Ibraheem khan
2           Muhammad Abid
3            Shumail Khan
4               Qasim Ali
Name: Name, dtype: object

In [29]:
type(classData['Name'])

pandas.core.series.Series

In [30]:
classData['GPA']

0    3.4
1    3.5
2    3.5
3    2.6
4    1.0
Name: GPA, dtype: float64

In [31]:
classData['GPA'][0]

3.4

In [32]:
classData['GPA'][0]=90

C:\anaconda\envs\jawadhadi\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [33]:
classData

   Unnamed: 0                  Name  Marks     Class   GPA
0           0  SAHIBZADA JAWAD HADI     80  1st Year  90.0
1           1         Ibraheem khan     72  2nd Year   3.5
2           2         Muhammad Abid     77  1st Year   3.5
3           3          Shumail Khan     65  3rd Year   2.6
4           4             Qasim Ali     15  2nd Year   1.0

In [34]:
classData['GPA'][4]

1.0

In [35]:
classData['GPA'][4]=5

C:\anaconda\envs\jawadhadi\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [36]:
classData["Class"][4]="Second Year"

C:\anaconda\envs\jawadhadi\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [37]:
classData

   Unnamed: 0                  Name  Marks        Class   GPA
0           0  SAHIBZADA JAWAD HADI     80     1st Year  90.0
1           1         Ibraheem khan     72     2nd Year   3.5
2           2         Muhammad Abid     77     1st Year   3.5
3           3          Shumail Khan     65     3rd Year   2.6
4           4             Qasim Ali     15  Second Year   5.0

In [38]:
classData["Name"][4]

'Qasim Ali'

In [39]:
classData

   Unnamed: 0                  Name  Marks        Class   GPA
0           0  SAHIBZADA JAWAD HADI     80     1st Year  90.0
1           1         Ibraheem khan     72     2nd Year   3.5
2           2         Muhammad Abid     77     1st Year   3.5
3           3          Shumail Khan     65     3rd Year   2.6
4           4             Qasim Ali     15  Second Year   5.0

In [40]:
classData.to_csv('pythonMondayNew.csv')

In [41]:
classData.to_csv('pythonMondayNewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [42]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [43]:
classData

        Unnamed: 0                  Name  Marks        Class   GPA
First            0  SAHIBZADA JAWAD HADI     80     1st Year  90.0
Second           1         Ibraheem khan     72     2nd Year   3.5
Third            2         Muhammad Abid     77     1st Year   3.5
Fourth           3          Shumail Khan     65     3rd Year   2.6
Fifth            4             Qasim Ali     15  Second Year   5.0

In [44]:
classData["Name"]["Fifth"]

'Qasim Ali'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [45]:
classData['GPA']

First     90.0
Second     3.5
Third      3.5
Fourth     2.6
Fifth      5.0
Name: GPA, dtype: float64

In [47]:
 type(classData['GPA'])

pandas.core.series.Series

In [48]:
classData

        Unnamed: 0                  Name  Marks        Class   GPA
First            0  SAHIBZADA JAWAD HADI     80     1st Year  90.0
Second           1         Ibraheem khan     72     2nd Year   3.5
Third            2         Muhammad Abid     77     1st Year   3.5
Fourth           3          Shumail Khan     65     3rd Year   2.6
Fifth            4             Qasim Ali     15  Second Year   5.0

In [49]:
type(classData)

pandas.core.frame.DataFrame

In [50]:
import numpy as np

In [51]:
series1= pd.Series(np.random.rand())

In [52]:
series1

0    0.999937
dtype: float64

In [53]:
series1= pd.Series(np.random.rand(30))

In [54]:
series1

0     0.730030
1     0.636450
2     0.484073
3     0.492118
4     0.528610
5     0.233897
6     0.822219
7     0.655210
8     0.072063
9     0.060612
10    0.515834
11    0.484010
12    0.781954
13    0.691014
14    0.266108
15    0.479743
16    0.142779
17    0.874554
18    0.942971
19    0.765965
20    0.964266
21    0.303930
22    0.310760
23    0.301043
24    0.563095
25    0.214445
26    0.455406
27    0.282708
28    0.578413
29    0.246733
dtype: float64

In [55]:
type(series1)

pandas.core.series.Series

In [56]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [57]:
type(newDf)

pandas.core.frame.DataFrame

In [58]:
newDf

            0         1         2         3         4
0    0.106252  0.532309  0.092199  0.226521  0.352968
1    0.027592  0.681266  0.368295  0.487846  0.535940
2    0.836495  0.087581  0.326718  0.898627  0.013803
3    0.282217  0.618414  0.513233  0.549363  0.499524
4    0.754379  0.462905  0.739670  0.828832  0.389436
..        ...       ...       ...       ...       ...
325  0.858176  0.943674  0.214518  0.255019  0.323928
326  0.855865  0.442723  0.623459  0.501572  0.736409
327  0.795258  0.585793  0.020976  0.668174  0.972614
328  0.118320  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

In [59]:
newDf.head(2)

          0         1         2         3         4
0  0.106252  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940

In [60]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [61]:
newDf.tail(2)

            0         1         2         3         4
328  0.118320  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

In [62]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [63]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.512292    0.522257    0.504555    0.495653    0.500659
std      0.291028    0.272543    0.289294    0.299930    0.288156
min      0.001075    0.004663    0.002783    0.004080    0.001627
25%      0.261698    0.292007    0.260840    0.225536    0.250602
50%      0.481738    0.535678    0.516394    0.486941    0.499148
75%      0.785505    0.766742    0.737016    0.758719    0.737689
max      0.999743    0.995231    0.999562    0.990824    0.997720

In [64]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [66]:
newDf[0][0]= "SAHIBZADA JAWAD HADI"

In [67]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [68]:
newDf

                        0         1         2         3         4
0    SAHIBZADA JAWAD HADI  0.532309  0.092199  0.226521  0.352968
1                0.027592  0.681266  0.368295  0.487846  0.535940
2                0.836495  0.087581  0.326718  0.898627  0.013803
3                0.282217  0.618414  0.513233  0.549363  0.499524
4                0.754379  0.462905  0.739670  0.828832  0.389436
..                    ...       ...       ...       ...       ...
325              0.858176  0.943674  0.214518  0.255019  0.323928
326              0.855865  0.442723  0.623459  0.501572  0.736409
327              0.795258  0.585793  0.020976  0.668174  0.972614
328               0.11832  0.320552  0.240601  0.089870  0.780125
329              0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

In [69]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [70]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [71]:
newDf.to_numpy()

array([['SAHIBZADA JAWAD HADI', 0.5323089637348619, 0.09219898973580753,
        0.2265208611376507, 0.35296834809163946],
       [0.027592296293997176, 0.6812655578297482, 0.3682953268647755,
        0.48784579540226625, 0.5359396603581738],
       [0.8364947110755142, 0.0875807481869233, 0.32671822800297323,
        0.898626585064842, 0.013802507032205424],
       ...,
       [0.7952580031674271, 0.585793293537255, 0.020975964459305718,
        0.6681739566796775, 0.9726138387292066],
       [0.11831992189646012, 0.3205524516063908, 0.2406011609520582,
        0.08986998210331232, 0.780124715872984],
       [0.442477602881434, 0.37655008084312536, 0.43575381980194106,
        0.2646762645573182, 0.04643454276769865]], dtype=object)

In [72]:
newDf[0][0]=0.30

In [73]:
newDf.head()

          0         1         2         3         4
0       0.3  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

In [74]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.027592,0.836495,0.282217,0.754379,0.924039,0.375222,0.238594,0.959505,0.187373,...,0.990315,0.249006,0.074236,0.105153,0.893686,0.858176,0.855865,0.795258,0.11832,0.442478
1,0.532309,0.681266,0.087581,0.618414,0.462905,0.922584,0.613746,0.903146,0.864033,0.261374,...,0.82639,0.526729,0.379731,0.386614,0.422694,0.943674,0.442723,0.585793,0.320552,0.37655
2,0.092199,0.368295,0.326718,0.513233,0.73967,0.14626,0.965162,0.999562,0.064294,0.61779,...,0.275216,0.603375,0.541669,0.723876,0.432522,0.214518,0.623459,0.020976,0.240601,0.435754
3,0.226521,0.487846,0.898627,0.549363,0.828832,0.930973,0.652332,0.225565,0.384387,0.187872,...,0.843626,0.553911,0.312837,0.039596,0.581201,0.255019,0.501572,0.668174,0.08987,0.264676
4,0.352968,0.53594,0.013803,0.499524,0.389436,0.500265,0.470823,0.737834,0.879,0.638739,...,0.491261,0.446842,0.411567,0.939131,0.522732,0.323928,0.736409,0.972614,0.780125,0.046435

In [75]:
newDf.sort_index(axis=0)

            0         1         2         3         4
0         0.3  0.532309  0.092199  0.226521  0.352968
1    0.027592  0.681266  0.368295  0.487846  0.535940
2    0.836495  0.087581  0.326718  0.898627  0.013803
3    0.282217  0.618414  0.513233  0.549363  0.499524
4    0.754379  0.462905  0.739670  0.828832  0.389436
..        ...       ...       ...       ...       ...
325  0.858176  0.943674  0.214518  0.255019  0.323928
326  0.855865  0.442723  0.623459  0.501572  0.736409
327  0.795258  0.585793  0.020976  0.668174  0.972614
328   0.11832  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

In [76]:
newDf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
329  0.442478  0.376550  0.435754  0.264676  0.046435
328   0.11832  0.320552  0.240601  0.089870  0.780125
327  0.795258  0.585793  0.020976  0.668174  0.972614
326  0.855865  0.442723  0.623459  0.501572  0.736409
325  0.858176  0.943674  0.214518  0.255019  0.323928
..        ...       ...       ...       ...       ...
4    0.754379  0.462905  0.739670  0.828832  0.389436
3    0.282217  0.618414  0.513233  0.549363  0.499524
2    0.836495  0.087581  0.326718  0.898627  0.013803
1    0.027592  0.681266  0.368295  0.487846  0.535940
0         0.3  0.532309  0.092199  0.226521  0.352968

[330 rows x 5 columns]

In [77]:
newDf.sort_index(axis=1)

            0         1         2         3         4
0         0.3  0.532309  0.092199  0.226521  0.352968
1    0.027592  0.681266  0.368295  0.487846  0.535940
2    0.836495  0.087581  0.326718  0.898627  0.013803
3    0.282217  0.618414  0.513233  0.549363  0.499524
4    0.754379  0.462905  0.739670  0.828832  0.389436
..        ...       ...       ...       ...       ...
325  0.858176  0.943674  0.214518  0.255019  0.323928
326  0.855865  0.442723  0.623459  0.501572  0.736409
327  0.795258  0.585793  0.020976  0.668174  0.972614
328   0.11832  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

In [78]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.352968  0.226521  0.092199  0.532309       0.3
1    0.535940  0.487846  0.368295  0.681266  0.027592
2    0.013803  0.898627  0.326718  0.087581  0.836495
3    0.499524  0.549363  0.513233  0.618414  0.282217
4    0.389436  0.828832  0.739670  0.462905  0.754379
..        ...       ...       ...       ...       ...
325  0.323928  0.255019  0.214518  0.943674  0.858176
326  0.736409  0.501572  0.623459  0.442723  0.855865
327  0.972614  0.668174  0.020976  0.585793  0.795258
328  0.780125  0.089870  0.240601  0.320552   0.11832
329  0.046435  0.264676  0.435754  0.376550  0.442478

[330 rows x 5 columns]

In [79]:
newDf.head()

          0         1         2         3         4
0       0.3  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

In [80]:
newDf[0][1]

0.027592296293997176

In [81]:
type(newDf[0])

pandas.core.series.Series

In [82]:
newDf

            0         1         2         3         4
0         0.3  0.532309  0.092199  0.226521  0.352968
1    0.027592  0.681266  0.368295  0.487846  0.535940
2    0.836495  0.087581  0.326718  0.898627  0.013803
3    0.282217  0.618414  0.513233  0.549363  0.499524
4    0.754379  0.462905  0.739670  0.828832  0.389436
..        ...       ...       ...       ...       ...
325  0.858176  0.943674  0.214518  0.255019  0.323928
326  0.855865  0.442723  0.623459  0.501572  0.736409
327  0.795258  0.585793  0.020976  0.668174  0.972614
328   0.11832  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

## view

In [83]:
newDfView=newDf

In [84]:
newDfView

            0         1         2         3         4
0         0.3  0.532309  0.092199  0.226521  0.352968
1    0.027592  0.681266  0.368295  0.487846  0.535940
2    0.836495  0.087581  0.326718  0.898627  0.013803
3    0.282217  0.618414  0.513233  0.549363  0.499524
4    0.754379  0.462905  0.739670  0.828832  0.389436
..        ...       ...       ...       ...       ...
325  0.858176  0.943674  0.214518  0.255019  0.323928
326  0.855865  0.442723  0.623459  0.501572  0.736409
327  0.795258  0.585793  0.020976  0.668174  0.972614
328   0.11832  0.320552  0.240601  0.089870  0.780125
329  0.442478  0.376550  0.435754  0.264676  0.046435

[330 rows x 5 columns]

In [85]:
newDfView[0][0]=765

C:\anaconda\envs\jawadhadi\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [86]:
newDf.head()

          0         1         2         3         4
0       765  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

In [87]:
newDfView.head()

          0         1         2         3         4
0       765  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

In [88]:
newDfCopy=newDf.copy()

In [89]:
newDfCopy[0][0]=656

C:\anaconda\envs\jawadhadi\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [90]:
newDf.head()

          0         1         2         3         4
0       765  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

In [91]:
newDfCopy.head()

          0         1         2         3         4
0       656  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524
4  0.754379  0.462905  0.739670  0.828832  0.389436

## loc

In [92]:
newDf.head(2)

          0         1         2         3         4
0       765  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940

In [93]:
newDf.loc[0,0]

765

In [94]:
newDf.loc[0,0]=5678

In [95]:
newDf.head(2)

          0         1         2         3         4
0      5678  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940

In [96]:
newDf.loc[0,4]

0.35296834809163946

In [97]:
newDf.loc[325,1]

0.9436744472873059

In [98]:
newDf.loc[0,0]=9875

In [99]:
newDf.head(2)

          0         1         2         3         4
0      9875  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940

In [100]:
newDf.columns=list("ABCDE")

In [101]:
newDf.head(3)

          A         B         C         D         E
0      9875  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803

In [102]:
newDf.loc[0, "A"]

9875

In [103]:
newDf.loc[0,"A"]=65

In [104]:
newDf.head(3)

          A         B         C         D         E
0        65  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803

In [105]:
newDf.loc[35,"A"]

0.8671306312266043

In [106]:
newDf.drop(0, axis=0).head(3)

          A         B         C         D         E
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803
3  0.282217  0.618414  0.513233  0.549363  0.499524

In [107]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.532309  0.092199  0.226521  0.352968
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803

In [108]:
newDf.head(3)

          A         B         C         D         E
0        65  0.532309  0.092199  0.226521  0.352968
1  0.027592  0.681266  0.368295  0.487846  0.535940
2  0.836495  0.087581  0.326718  0.898627  0.013803

In [109]:
newDf = newDf.drop("A", axis=1)

In [110]:
newDf.head(3)

          B         C         D         E
0  0.532309  0.092199  0.226521  0.352968
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803

In [111]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.368295  0.487846
2  0.326718  0.898627

In [112]:
newDf.head(3)

          B         C         D         E
0  0.532309  0.092199  0.226521  0.352968
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803

In [113]:
newDf.loc[:,["C","D"]]

            C         D
0    0.092199  0.226521
1    0.368295  0.487846
2    0.326718  0.898627
3    0.513233  0.549363
4    0.739670  0.828832
..        ...       ...
325  0.214518  0.255019
326  0.623459  0.501572
327  0.020976  0.668174
328  0.240601  0.089870
329  0.435754  0.264676

[330 rows x 2 columns]

In [114]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803

In [115]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.092199  0.226521
1  0.368295  0.487846
2  0.326718  0.898627
3  0.513233  0.549363
4  0.739670  0.828832
5  0.146260  0.930973

In [116]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.681266  0.368295  0.487846
2  0.087581  0.326718  0.898627

In [117]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
2    0.087581  0.326718  0.898627  0.013803
9    0.261374  0.617790  0.187872  0.638739
10   0.281561  0.237581  0.210739  0.011657
12   0.041938  0.147656  0.500559  0.692832
14   0.064925  0.330439  0.749881  0.894467
..        ...       ...       ...       ...
291  0.202532  0.463246  0.543620  0.685624
302  0.268043  0.274878  0.465072  0.709624
304  0.044467  0.695731  0.317222  0.183108
311  0.102014  0.124803  0.681335  0.809512
316  0.198586  0.055183  0.791677  0.107130

[86 rows x 4 columns]

In [118]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
2    0.087581  0.326718  0.898627  0.013803
10   0.281561  0.237581  0.210739  0.011657
12   0.041938  0.147656  0.500559  0.692832
14   0.064925  0.330439  0.749881  0.894467
15   0.232837  0.790089  0.390360  0.049274
..        ...       ...       ...       ...
291  0.202532  0.463246  0.543620  0.685624
302  0.268043  0.274878  0.465072  0.709624
304  0.044467  0.695731  0.317222  0.183108
311  0.102014  0.124803  0.681335  0.809512
316  0.198586  0.055183  0.791677  0.107130

[65 rows x 4 columns]

In [119]:
newDf.head(3)

          B         C         D         E
0  0.532309  0.092199  0.226521  0.352968
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803

## iloc

In [120]:
newDf.iloc[0,0]

0.5323089637348619

In [121]:
newDf.iloc[0,0]=555

In [122]:
newDf.head()

            B         C         D         E
0  555.000000  0.092199  0.226521  0.352968
1    0.681266  0.368295  0.487846  0.535940
2    0.087581  0.326718  0.898627  0.013803
3    0.618414  0.513233  0.549363  0.499524
4    0.462905  0.739670  0.828832  0.389436

In [123]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.092199  0.352968
4  0.739670  0.389436

In [124]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.092199  0.226521  0.352968
1    0.681266  0.368295  0.487846  0.535940
2    0.087581  0.326718  0.898627  0.013803
3    0.618414  0.513233  0.549363  0.499524

In [125]:
newDf.drop(0).head()

          B         C         D         E
1  0.681266  0.368295  0.487846  0.535940
2  0.087581  0.326718  0.898627  0.013803
3  0.618414  0.513233  0.549363  0.499524
4  0.462905  0.739670  0.828832  0.389436
5  0.922584  0.146260  0.930973  0.500265

In [126]:
# newDf.drop(0, axis=1)

In [127]:
# newDf.drop("B", axis=1).head()

In [128]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.352968
1    0.681266  0.535940
2    0.087581  0.013803
3    0.618414  0.499524
4    0.462905  0.389436

In [129]:
newDf.head()

            B         C         D         E
0  555.000000  0.092199  0.226521  0.352968
1    0.681266  0.368295  0.487846  0.535940
2    0.087581  0.326718  0.898627  0.013803
3    0.618414  0.513233  0.549363  0.499524
4    0.462905  0.739670  0.828832  0.389436

In [130]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [131]:
newDf.head()

          C         E
0  0.092199  0.352968
1  0.368295  0.535940
2  0.326718  0.013803
3  0.513233  0.499524
4  0.739670  0.389436

In [132]:
newDf.reset_index().head()

   index         C         E
0      0  0.092199  0.352968
1      1  0.368295  0.535940
2      2  0.326718  0.013803
3      3  0.513233  0.499524
4      4  0.739670  0.389436

In [133]:
newDf.reset_index(drop=True).head()

          C         E
0  0.092199  0.352968
1  0.368295  0.535940
2  0.326718  0.013803
3  0.513233  0.499524
4  0.739670  0.389436

In [134]:
newDf.head()

          C         E
0  0.092199  0.352968
1  0.368295  0.535940
2  0.326718  0.013803
3  0.513233  0.499524
4  0.739670  0.389436

In [135]:
newDf.reset_index(drop=True, inplace=True)

In [136]:
newDf.head()

          C         E
0  0.092199  0.352968
1  0.368295  0.535940
2  0.326718  0.013803
3  0.513233  0.499524
4  0.739670  0.389436

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [137]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [138]:
df = pd.DataFrame(data)

In [139]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [140]:
df.groupby('Company')

##### You can save this object as a new variable:

In [141]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [142]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [143]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [144]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [145]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [146]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [147]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [148]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0